In [25]:
import numpy as np
import pandas as pd

df = pd.read_csv("Long_to_wide.csv")
df2 = df.groupby(["Std_ID", "Name"])
pd.DataFrame(df2.groups.values())
df.head()

   Std_ID    Name     Subj  Marks
0    1724  Aditya    Hindi     69
1    1724  Aditya  English     64
2    1724  Aditya     Math     66
3    1724  Aditya  Science     69
4    1728    Mani    Hindi     81

In [16]:
x = {"a":5, "b":6}
x.values()

dict_values([5, 6])

In [28]:
df2.get_group((1728, "Mani"))

   Std_ID  Name     Subj  Marks
4    1728  Mani    Hindi     81
5    1728  Mani  English     69
6    1728  Mani     Math     85
7    1728  Mani  Science     81

In [29]:
df3 = df.groupby("Name")

In [30]:
df3.get_group("Mani")

   Std_ID  Name     Subj  Marks
4    1728  Mani    Hindi     81
5    1728  Mani  English     69
6    1728  Mani     Math     85
7    1728  Mani  Science     81

In [32]:
df.pivot(index = "Std_ID", columns = "Subj", values = "Marks")

Subj    English  Hindi  Math  Science
Std_ID
1724         64     69    66       69
1728         69     81    85       81
1729         91     90    68       81
1730         72     91    85       88
1731         69     62    64       70
1732         74     76    83       78

In [48]:
k = 0
def func(name, x):
    global k
    a = len(x)
    b = len(x[x["Data1"]>50])
    temp_df.loc[k] = [name[0], name[1], a, b]
    k +=1
    
test_csv = pd.read_csv("Group_test.csv")
grp_test = test_csv.groupby(["Std_ID", "Key"])
temp_df = pd.DataFrame(columns=["key1", "key2", "A", "B"])
grp_test.apply(lambda x : func(x.name, x))
print(temp_df)

    key1 key2  A  B
0   1724    A  1  1
1   1724    A  1  1
2   1724    C  3  0
3   1728    A  1  1
4   1728    B  1  1
5   1728    C  2  0
6   1729    A  1  0
7   1729    B  3  3
8   1730    B  4  1
9   1731    B  2  1
10  1731    C  2  1
11  1732    B  1  0
12  1732    C  3  1

In [70]:
test_csv.columns.to_series().groupby(test_csv.dtypes).groups

{dtype('int64'): Index(['Std_ID', 'Data1', 'Data2'], dtype='object'),
 dtype('O'): Index(['Key'], dtype='object')}

In [76]:
{str(x): list(y) for x, y in test_csv.groupby(test_csv.dtypes, axis=1)}

{'int64': ['Std_ID', 'Data1', 'Data2'], 'object': ['Key']}

In [81]:
pd.DataFrame([list("abcde")], columns = list("65478"))
#pd.DataFrame([list(range(5))], columns=["a{}".format(i) for i in range(5)])

   6  5  4  7  8
0  a  b  c  d  e

In [90]:
test_csv.keys()

Index(['Std_ID', 'Key', 'Data1', 'Data2'], dtype='object')

In [108]:
test_csv.Key.count()

24

In [24]:
df = pd.DataFrame({"A":list(range(5,25,2)), "B": list(range(50,30,-2))})
df["C"] = ["CLA" if((m*n) <350) else "CLB" if(((m*n)>300) & ((m*n) < 600)) else "CLC" for m, n in zip(df["A"],df["B"]) ]
df

    A   B    C
0   5  50  CLA
1   7  48  CLA
2   9  46  CLB
3  11  44  CLB
4  13  42  CLB
5  15  40  CLC
6  17  38  CLC
7  19  36  CLC
8  21  34  CLC
9  23  32  CLC

In [45]:
df_x = df.pivot(index = "Std_ID", columns = "Subj", values = "Marks")
df_x2 = df[["Std_ID", "Name"]].drop_duplicates()
df_x3 = pd.merge(df_x2, df_x, right_index = True, left_on = "Std_ID", how = "inner")
#df_x3.reset_index(drop = True)
df_x3
# Remember when merging 2 datasets, one with column values and other index values, for final merged dataframe, 
# index used if of dataframe for which columns are used

    Std_ID     Name  English  Hindi  Math  Science
0     1724   Aditya       64     69    66       69
4     1728     Mani       69     81    85       81
8     1729    Rajat       91     90    68       81
12    1730  Trivedi       72     91    85       88
16    1731   Shasha       69     62    64       70
20    1732  Trivedi       74     76    83       78